{
    "code": "FT1103.1",
    "name": "Application",
    "parent_technique": "Check Gift Card Balance",
    "tactics": [
      "Initial Access"
    ],
    "schemes": [
      "Gift Card Fraud"
    ],
    "sub_techniques": [],
    "details": [
      {
        "section_header": "Technique Description",
        "section_details": [
          {
            "section_sub_header": "Description",
            "section_info": [
              "The fraudster may iteratively probe web applications using built-in functions in the applications to confirm the gift card is active and has funds. The fraudster may use gift card numbers that are generated by brute force guessing, purchased from a source or gathered from victims.",
              "A fraudster may purchase a large amount of gift card numbers on the dark web. They will use the web application built-in function and in a manual or automated fashion check to see if the gift card is active and has funds. This information can be used in future operations to convert the gift card into usable funds for the fraudster."
            ]
          }
        ]
      },
      {
        "section_header": "Mitigation",
        "section_details": [
          {
            "section_sub_header": "Login Required",
            "section_info": [
              "Require authentication before displaying gift card status or value."
            ]
          },
          {
            "section_sub_header": "Access Code Required",
            "section_info": [
              "Require an access code that is separate from the gift card number before revealing the status and funds on the gift cards."
            ]
          },
          {
            "section_sub_header": "Online Location Data",
            "section_info": [
              "Some physical locations should not be able to check gift card balance. Some locations may also be the source of repeated fraud attempts. Prevent the ability to check gift card status and funds based on locations."
            ]
          }
        ]
      },
      {
        "section_header": "Detection",
        "section_details": [
          {
            "section_sub_header": "Network Traffic Attributes",
            "section_info": [
              "Monitor for network traffic attributes such as IP address, DNS name, ASN and other digital location attributes, especially if some of these sources have known fraud activity or have a high risk of fraud activity."
            ]
          },
          {
            "section_sub_header": "Time-Based Attributes",
            "section_info": [
              "Based on the location of your operations, monitor for activities that occur during off hours."
            ]
          },
          {
            "section_sub_header": "Device Attributes",
            "section_info": [
              "Monitor device factors such as device type, user agent string, operating system, cookies."
            ]
          },
          {
            "section_sub_header": "Velocity Attributes",
            "section_info": [
              "Monitor for number of requests based on a predetermined number of requests over a set amount of time."
            ]
          }
        ]
      }
    ],
    "sources": [
      {
        "references": [
          {
            "name": "Industry Partner Collaboration",
            "link": ""
          }
        ]
      }
    ]
  }