{
  "code": "FT1103",
  "name": "Check Gift Card Balance",
  "parent_technique": "",
  "tactics": [
    "Initial Access"
  ],
  "schemes": [
    "Gift Card Fraud"
  ],
  "sub_techniques": [
    "Application",
    "Phone Verification",
    "In-Store Gift Card Verification"
  ],
  "technique_description": [
    "The fraudster may abuse legitimate functions to confirm a gift card is active and has funds. To reduce overhead, retailers may have autonomous systems for gift card owners and recipients to check if their gift card is usable and has value. These systems are generally available to the public for interaction."
  ],
  "mitigation": [
    {
      "type": "Login Required",
      "details": [
        "Require authentication before displaying gift card status or value."
      ]
    },
    {
      "type": "Access Code Required",
      "details": [
        "Require an access code that is separate from the gift card number before revealing the status and funds on the gift cards."
      ]
    },
    {
      "type": "Online Location Data",
      "details": [
        "Some physical locations should not be able to check gift card balance. Some locations may also be the source of repeated fraud attempts. Prevent the ability to check gift card status and funds based on locations."
      ]
    },
    {
      "type": "Phone Number",
      "details": [
        "Automatically block phone numbers related to VoIP services and phone numbers that have been known to be used to perpetrate fraud."
      ]
    }
  ],
  "detection": [
    {
      "type": "Network Traffic Attributes",
      "details": [
        "Monitor for network traffic attributes such as IP address, DNS name, ASN and other digital location attributes, especially if some of these sources have known fraud activity or have a high risk of fraud activity."
      ]
    },
    {
      "type": "Time-Based Attributes",
      "details": [
        "Based on the location of your operations, monitor for activities that occur during off hours."
      ]
    },
    {
      "type": "Device Attributes",
      "details": [
        "Monitor device factors such as device type, user agent string, operating system, cookies."
      ]
    },
    {
      "type": "Velocity Attributes",
      "details": [
        "Monitor for number of requests based on a predetermined number of requests over a set amount of time."
      ]
    },
    {
      "type": "VoIP Attribute",
      "details": [
        "Monitor for use of VoIP numbers that are not tied to a physical landline or mobile phone."
      ]
    }
  ],
  "references": [
    {
      "name": "Industry Partner Collaboration",
      "link": ""
    }
  ],
  "hide": false,
  "color": "",
  "risk_score": 0
}