{
  "code": "FT1105",
  "name": "Credential Stuffing",
  "parent_technqiue": "",
  "tactics": [
    "Initial Access"
  ],
  "schemes": [
    "Account Take Over"
  ],
  "sub_techniques": [],
  "details": [
    {
      "technique_description": [
        {
          "description": [
            "Fraudsters abuse a variety of web automation tools to automate login attempts using credential lists known as “combolists.” Web automation serves a legitimate purpose in web application development and testing, but commercial projects can be abused by threat actors for illicit activity.",
            "Fraudsters develop custom credential stuffing tools to automate login attempts. These tools can be site-specific or configurable via files known as “configs” which are then either sold or shared in underground communities. These tools range from simple scripts where technical details for the transaction are coded into the script itself, to fully configurable tools where actors can insert their own variables and other parameters into the automation."
          ]
        }
      ]
    },
    {
      "mitigation": [
        {
          "behavioral_prevention": [
            "Many commercial services provide bot detection and mitigation, often incorporated into content delivery networks and other management packages.",
            "Commonly available tooling includes default technical indicators which should be mitigated at the edge and automatically denied."
          ]
        }
      ]
    },
    {
      "detection": [
        {
          "velocity_attribute": [
            "Monitor for surges in login attempts and other anomalous activity.",
            "Monitor the response to login attempts where a surge in attempts to access accounts that do not exist at the target organization is a strong indicator of automated credential stuffing."
          ]
        },
        {
          "behavioral_attributes ": [
            "Monitor for repeated patterns of activity post-login, which is an indicator that the activity is automated."
          ]
        }
      ]
    }
  ],
  "sources": [
    {
      "references": [
        {
          "name": "MITRE ATT&CK",
          "link":"https://attack.mitre.org/techniques/T1110/004/"
        },
        {
          "name": "Top 10 Digital Commerce Account Risks & How to Mitigate Them by Gunnar Peterson",
          "link":"https://www.forter.com/blog/rh-isac-account-risk-mitigation/"
        }
      ]
    }
  ]
}