{
  "code": "FT1104.1",
  "name": "Fraudulent Account",
  "parent_technique": "Valid Accounts",
  "tactics": [
    "Pre-Compromise",
    "Initial Access"
  ],
  "schemes": [
    "Gift Card Fraud",
    "Account Take Over"
  ],
  "sub_techniques": [],
  "technique_description": [
    "The fraudster uses a legitimate resource to create an account for malicious usage. These accounts may be used for reconnaissance and to probe the defenses of the victim’s applications.",
    "One example of this is if a fraudster creates an account with fake information. Using this as a foothold the fraudster may gather information on the application itself such as naming convention, loyalty points and other information that may be used to monetize the account."
  ],
  "mitigation": [
    {
      "type": "Multi-Factor Authentication",
      "details": [
        "Before permitting account changes, use multiple forms of authentication such as username and password paired with a one-time passcode before permitting access.",
        "If relevant, send confirmatory message to the original contact fields (eg., original email address, phone number, street address)."
      ],
      "implemented": false
    }
  ],
  "detection": [
    {
      "type": "Network Traffic Attributes",
      "details": [
        "Monitor for network traffic attributes such as IP address, DNS name, ASN and other digital location attributes, especially if some of these sources have known fraud activity or have a high risk of fraud activity."
      ],
      "implemented": false
    },
    {
      "type": "Time-Based Attributes",
      "details": [
        "Based on the location of your operations, monitor for activities that occur during off hours."
      ],
      "implemented": false
    },
    {
      "type": "Device Attributes",
      "details": [
        "Monitor device factors such as device type, user agent string, operating system, cookies."
      ],
      "implemented": false
    },
    {
      "type": "Velocity Attributes",
      "details": [
        "Monitor for accounts that are created quickly in succession from the same location or with similar features."
      ],
      "implemented": false
    }
  ],
  "references": [
    {
      "name": "Top 10 Digital Commerce Account Risks & How to Mitigate Them by Gunnar Peterson",
      "source": "https://www.forter.com/blog/rh-isac-account-risk-mitigation/"
    }
  ],
  "hide": false,
  "color": "",
  "risk_score": 0
}