{
  "code": "FT1203",
  "name": "Gift Card Tampering",
  "parent_technqiue": "",
  "tactics": [
    "Control"
  ],
  "schemes": [
    "Gift Card Fraud"
  ],
  "sub_techniques": [],
  "details": [
    {
      "technique_description": [
        {
          "description": [
            "Fraudster takes physical possession of an unactivated gift card and takes the information that allows them to control the gift card when it is funded and activated.",
            "An example is if a fraudster steals gift cards from a store. They copy down the pertinent information needed to control the gift card and verify funds such as gift card number and security PIN. The fraudster then repackages the gift card and returns it to the store. When a victim purchases the gift card and loads value, the fraudster can spend the funds on the gift card without the victim’s awareness."
          ]
        }
      ]
    },
    {
      "mitigation": [
        {
          "primary_gift_card_lock-in": [
            "For gift cards, lock the gift card into the identity of the purchaser. Do not allow another person to use the gift card without identify verification or authentication."
          ]
        },
        {
          "login_required": [
            "For gift cards, require an account before permitting purchase of or transfer."
          ]
        },
        {
          "gift_card_location": [
            "Store gift cards behind checkout counter to limit theft."
          ]
        },
        {
          "video_surveillance_system": [
            "For in-store gift card displays, consider the placement of a video security camera (CCTV) to monitor the area. Utilize signage to inform customers of CCTV use."
          ]
        }
      ]
    },
    {
      "detection": [
        {
          "security_guard": [
            "At physical locations, use security guards and/or other store employees to identify instances of fraudsters stealing gift cards and/or returning tampered gift cards."
          ]
        },
        {
          "video_surveillance_systems": [
            "At physical locations, use video surveillance to identify instances of fraudsters stealing gift cards and/or returning tampered gift cards."
          ]
        }
      ]
    }
  ],
  "sources": [
    {
      "references": [
        {
          "name": "Industry Partner Collaboration",
          "link": ""
        },
        {
          "name": "Detecting and Reporting the Illicit Financial Flows Tied to Organized Theft Groups (OTG) and Organized Retail Crime (ORC)",
          "link": "https://www.acams.org/en/media/document/29436"
        }
      ]
    }
  ]
}