{
  "code": "FT1205",
  "name": "Loyalty Points Abuse",
  "parent_technique": "",
  "tactics": [
    "Control"
  ],
  "schemes": [
    "Account Take Over"
  ],
  "sub_techniques": [],
  "technique_description": [
    "The fraudster converts loyalty points into items or gift cards that can be used from monetization.",
    "One example of this is if a fraudster successfully compromises a victim’s account through means such as Social Engineering. They can convert the victim’s loyalty points into a gift card that the fraudster controls. This gift card can be further used for monetization."
  ],
  "mitigation": [
    {
      "type": "Multi-Factor Authentication",
      "details": [
        "Use multiple forms of authentication such as username and password paired with a one-time passcode before permitting access.",
        "Require identity verification upon detection of access requests that are significantly different than what is expected for the individual."
      ]
    },
    {
      "type": "Password Policy",
      "details": [
        "Encourage using strong passwords with sufficient length and complexity. Discourage reusing passwords."
      ]
    }
  ],
  "detection": [
    {
      "type": "Network Traffic Attributes",
      "details": [
        "Monitor for network traffic attributes such as IP address, DNS name, ASN and other digital location attributes, especially if some of these sources have known fraud activity or have a high risk of fraud activity."
      ]
    },
    {
      "type": "Time-Based Attributes",
      "details": [
        "Based on the location of your operations, monitor for activities that occur during off hours."
      ]
    },
    {
      "type": "Device Attributes",
      "details": [
        "Monitor device factors such as device type, user agent string, operating system, cookies."
      ]
    },
    {
      "type": "Behavioral Attributes",
      "details": [
        "Monitor for access attempts and purchases that are significantly different from known good behavior for each customer."
      ]
    }
  ],
  "references": [
    {
      "name": "Industry Partner Collaboration",
      "source": ""
    }
  ],
  "hide": false,
  "color": "",
  "risk_score": 0
}