{
  "code": "FT1101",
  "name": "Shoplifting",
  "parent_technique": "",
  "tactics": [
    "Initial Access"
  ],
  "schemes": [
    "Gift Card Fraud"
  ],
  "sub_techniques": [],
  "details": [
    {
      "section_header": "Technique Description",
      "section_details": [
        {
          "section_sub_header": "Description",
          "section_info": [
            "Taking items from a store without paying for them. Shoplifting can range from concealing items in personal clothing or bags to swapping price tags to make items appear cheaper. Items shoplifted to support fraud are typically high value, small in size and easy to resell.",
            "Examples of commonly stolen items to support fraud are gift cards, electronics and luxury goods."
          ]
        }
      ]
    },
    {
      "section_header": "Mitigation",
      "section_details": [
        {
          "section_sub_header": "Bag Control",
          "section_info": [
            "Control the size and type of bags that are permitted inside the store."
          ]
        },
        {
          "section_sub_header": "Structured Loss Prevention Program",
          "section_info": [
            "Implement a structured loss prevention program involving physical security, policies, procedures, resources and systems to prevent, deter and identify merchandise or gift card loss. "
          ]
        },
        {
          "section_sub_header": "Anti-Theft Prevention",
          "section_info": [
            "Additional physical protection of products from theft such as locked shelving, containers and vending machines, and storing items behind checkout counter."
          ]
        }
      ]
    },
    {
      "section_header": "Detection",
      "section_details": [
        {
          "section_sub_header": "Anti-Theft Security Tags ",
          "section_info": [
            "Attach a device to items that will cause an alarm if removed from the store without authorization."
          ]
        },
        {
          "section_sub_header": "Security Guards",
          "section_info": [
            "At physical locations, use security guards to identify and deter shoplifting."
          ]
        },
        {
          "section_sub_header": "Video Surveillance Systems",
          "section_info": [
            "Monitor video feeds for suspicious activity around high-value items."
          ]
        }
      ]
    }
  ],
  "sources": [
    {
      "references": [
        {
          "name": "Detecting and Reporting the Illicit Financial Flows Tied to Organized Theft Groups (OTG) and Organized Retail Crime (ORC)",
          "link": "https://www.acams.org/en/media/document/29436"
        }
      ]
    }
  ]
}